In [1]:
import pandas as pd
df=pd.read_csv('nyc_weather.csv')
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [2]:
df.Temperature.max()
# get maximum temperature from column Temperature

50

In [3]:
df['EST'][df['Events']=='Rain']
# find date on which there is rain

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [5]:
df['WindSpeedMPH'].mean()
# find the mean value of WindSpeed

6.892857142857143

In [26]:
import pandas as pd
df=pd.read_csv('weather_data.csv')
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [29]:
# list of tuple
student_data=[('1/1/2017','Sujan',11,'Present'),
             ('1/1/2017','Sajana',28,'Absent'),
             ('1/2/2017','Sujan',71,'Present'),
             ('1/2/2017','Sajana',27,'Present'),
             ('1/3/2017','Sujan',81,'Absent'),
             ('1/3/2017','Sajana',72,'Absent')]
df=pd.DataFrame(student_data,columns=['Date','Name','Marks','Status'])
df.to_csv('student_data.csv')#write data frame to csv file

In [30]:
df.shape
# gives the totoal no of rows and columns

(6, 4)

In [31]:
df[1:3]
# slicing

       Date    Name  Marks   Status
1  1/1/2017  Sajana     28   Absent
2  1/2/2017   Sujan     71  Present

In [32]:
df['Name'][1:3]
# slicing

1    Sajana
2     Sujan
Name: Name, dtype: object

In [33]:
df.Status#print particular column

0    Present
1     Absent
2    Present
3    Present
4     Absent
5     Absent
Name: Status, dtype: object

In [34]:
df[['Name','Status']]#for multiple columns

     Name   Status
0   Sujan  Present
1  Sajana   Absent
2   Sujan  Present
3  Sajana  Present
4   Sujan   Absent
5  Sajana   Absent

In [36]:
df['Marks'].describe()

count     6.000000
mean     48.333333
std      29.676028
min      11.000000
25%      27.250000
50%      49.500000
75%      71.750000
max      81.000000
Name: Marks, dtype: float64

In [37]:
df[df['Marks']==df['Marks'].max()]
# select rows having maximum marks

       Date   Name  Marks  Status
4  1/3/2017  Sujan     81  Absent

In [39]:
df.Name[df['Marks']==df['Marks'].max()]
# select column name having maximum marks

4    Sujan
Name: Name, dtype: object